<?php 
$zacatekPlatnosti = '10.12.2017';
$konecPlatnosti = null; //'x.x.2018 23:59:59';

$obeh[1] = ['107951_1', '8460_1', '108401_1', '8453_1', '18407_1', '18407_2', '8455_1', '8343_1', '18409_1', '18442_1', '18409_2', '18444_1', '18430_1', '8440_1', '8441_1', '8442_1', '8443_1', '8452_1'];
$obeh[2] = ['8451_1', '8404_1', '8406_1', '21925_1', '108403_1', '21924_1', '108405_1', '118413_1', '18410_1', '8452_2'];

$omezeni['107951_1'] = 'X,-2712,-2812,-2912,-3012,-3112,-0101,-0201,-0202,-2903,-0207,-3108,-2910,-3010';
$omezeni['108401_1'] = 'X,-0207,-3108,-2712,-2812,-2912,-0201,-0202,-2903,-2910,-3010';
$omezeni['108403_1'] = '6';
$omezeni['108405_1'] = '5,0102,2803,3004,0705,2709,-2912,-0202,-3003,-0607,-3108,-2809';
$omezeni['118413_1'] = '5,0102,2803,2709,-2912,-0202,-3003,-0607,-3108,-2809';
$omezeni['18407_1'] = '6,-2512,-0101';
$omezeni['18407_2'] = 'T,3003,0105,0805,0507,2809,-3103,-0707,-2909';
$omezeni['18409_1'] = 'T';
$omezeni['18409_2'] = '6';
$omezeni['18410_1'] = 'X5';
$omezeni['18430_1'] = '25';
$omezeni['18442_1'] = '6,3003,0105,0805,0507,2809,1711,-3103,-0707';
$omezeni['18444_1'] = '25';
$omezeni['21924_1'] = 'X5';
$omezeni['21925_1'] = 'T';
$omezeni['8343_1'] = 'T,-2512,-0101,2612,3103,0104,0204,0607,0707,2909';
$omezeni['8404_1'] = '25,-2512,-2612,-0101';
$omezeni['8406_1'] = 'X,-2712,-2812,-2912,-3012,-3112,-0101,-0201,-0202,-2903,-0207,-3108,-2910,-3010';
$omezeni['8440_1'] = 'X,-2712,-2812,-2912';
$omezeni['8441_1'] = 'X,-2712,-2812,-2912';
$omezeni['8442_1'] = 'X,-2712,-2812,-2912';
$omezeni['8443_1'] = 'X,-2712,-2812,-2912';
$omezeni['8451_1'] = 'X';
$omezeni['8452_1'] = 'zX';
$omezeni['8452_2'] = 'z25';
$omezeni['8453_1'] = '25,-2512,-2612,-0101';
$omezeni['8455_1'] = 'X,-2712,-2812,-2912,-3012,-3112,-0101,-0201,-0202,-2903,-0207,-3108,-2910,-3010';
$omezeni['8460_1'] = 'X,-0207,-3108,-2712,-2812,-2912,-0201,-0202,-2903,-2910,-3010';

$trasa['107951_1'] = ['Protivín;4:10','Písek;4:55'];
$trasa['108401_1'] = ['Ražice;5:13','Milevsko;6:06'];
$trasa['108403_1'] = ['Ražice;7:21','Tábor;8:50'];
$trasa['108405_1'] = ['Ražice;9:21','Tábor;10:50'];
$trasa['118413_1'] = ['Tábor;14:07','Pelhřimov;15:13'];
$trasa['18407_1'] = ['Tábor;6:27','Horní Cerekev;7:53'];
$trasa['18407_2'] = ['Tábor;6:27','Obrataň;6:54'];
$trasa['18409_1'] = ['Tábor;8:09','Horní Cerekev;9:50'];
$trasa['18409_2'] = ['Pelhřimov;9:25','Horní Cerekev;9:50'];
$trasa['18410_1'] = ['Pelhřimov;15:23','Tábor;16:23'];
$trasa['18430_1'] = ['Pelhřimov;12:23','Tábor;13:25'];
$trasa['18442_1'] = ['Horní Cerekev;8:27','Pelhřimov;8:50'];
$trasa['18444_1'] = ['Horní Cerekev;10:04','Pelhřimov;10:27'];
$trasa['21924_1'] = ['Protivín;9:00','Ražice;9:08'];
$trasa['21925_1'] = ['Ražice;6:41','Protivín;6:51'];
$trasa['8343_1'] = ['Obrataň;7:13','Tábor;7:40'];
$trasa['8404_1'] = ['Tábor;4:51','Ražice;6:35'];
$trasa['8406_1'] = ['Tábor;6:08','Protivín;8:03'];
$trasa['8440_1'] = ['Tábor;14:08','Branice;14:51'];
$trasa['8441_1'] = ['Branice;15:03','Tábor;15:50'];
$trasa['8442_1'] = ['Tábor;16:08','Branice;16:51'];
$trasa['8443_1'] = ['Branice;17:03','Tábor;17:50'];
$trasa['8451_1'] = ['Milevsko;4:39','Tábor;5:10'];
$trasa['8452_1'] = ['Tábor;21:08','Milevsko;21:41'];
$trasa['8452_2'] = ['Tábor;21:08','Milevsko;21:41'];
$trasa['8453_1'] = ['Milevsko;5:28','Tábor;5:58'];
$trasa['8455_1'] = ['Milevsko;6:54','Tábor;7:28'];
$trasa['8460_1'] = ['Písek;4:57','Ražice;5:07'];

$poznamkaObehu['107951_1'] = ['pk', 'postrk'];
$poznamkaObehu['108401_1'] = ['pk', 'postrk'];
$poznamkaObehu['108403_1'] = ['pk', 'postrk'];
$poznamkaObehu['108405_1'] = ['pk', 'postrk'];
$poznamkaObehu['118413_1'] = ['pk', 'postrk'];




if (empty($jmenaVlaku)) $jmenaVlaku = [];
if (empty($zeme)) $zeme = [];

@$ts845 -> obeh (new Obeh2($obeh, ['trasa' => $trasa, 'omezeni' => $omezeni, 'typ' => $typ, 'poznamka' => $poznamkaObehu, 'jmenaVlaku' => $jmenaVlaku, 'zeme' => $zeme], $zacatekPlatnosti, $konecPlatnosti)); 

unset($obeh); 
unset($trasa); 
unset($omezeni); 
unset($zacatekPlatnosti); 
unset($konecPlatnosti);


